# 处理缺失值

## 过滤缺失值

In [1]:
import numpy as np
import pandas as pd

In [2]:
data1 = pd.Series([1, np.nan, 3.5, np.nan, 7])
data1.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [3]:
data1[data1.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [4]:
data1[data1.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [5]:
data2 = pd.DataFrame([[1, 6.5, 3], [1, np.nan, np.nan], [np.nan, np.nan, np.nan,], [np.nan, 6.5, 3]])
data2.dropna()

     0    1    2
0  1.0  6.5  3.0

In [6]:
data2.dropna(how="all") # how="all"时删除所有值均为NA的行，默认为how="any"代表只要有一个NA就删除整行

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [7]:
df1 = pd.DataFrame(np.random.randn(7, 3))
df1.iloc[:4, 1] = np.nan
df1.iloc[:2, 2] = np.nan
df1

          0         1         2
0  0.698959       NaN       NaN
1  0.973060       NaN       NaN
2  0.561417       NaN -2.197469
3  0.517275       NaN -0.936033
4  0.572950  1.830689 -1.231616
5  0.035950  1.605405 -2.026272
6  0.324163 -0.527470  0.340573

In [8]:
df1.dropna(thresh=2) # 保留包含一定空值的行

          0         1         2
2  0.561417       NaN -2.197469
3  0.517275       NaN -0.936033
4  0.572950  1.830689 -1.231616
5  0.035950  1.605405 -2.026272
6  0.324163 -0.527470  0.340573

## 补全缺失值

In [9]:
df1.fillna(0)

          0         1         2
0  0.698959  0.000000  0.000000
1  0.973060  0.000000  0.000000
2  0.561417  0.000000 -2.197469
3  0.517275  0.000000 -0.936033
4  0.572950  1.830689 -1.231616
5  0.035950  1.605405 -2.026272
6  0.324163 -0.527470  0.340573

In [10]:
df1.fillna(method="bfill") # 用后面的值填充前面的空值

          0         1         2
0  0.698959  1.830689 -2.197469
1  0.973060  1.830689 -2.197469
2  0.561417  1.830689 -2.197469
3  0.517275  1.830689 -0.936033
4  0.572950  1.830689 -1.231616
5  0.035950  1.605405 -2.026272
6  0.324163 -0.527470  0.340573

In [11]:
df1.fillna({1:0.5, 2:0}) # 为不同的列填充不同的值

          0         1         2
0  0.698959  0.500000  0.000000
1  0.973060  0.500000  0.000000
2  0.561417  0.500000 -2.197469
3  0.517275  0.500000 -0.936033
4  0.572950  1.830689 -1.231616
5  0.035950  1.605405 -2.026272
6  0.324163 -0.527470  0.340573

In [12]:
df2 = pd.DataFrame(np.random.randn(6, 3))
df2.iloc[2:, 1] = np.nan
df2.iloc[4:, 2] = np.nan
df2

          0         1         2
0  2.271276  0.407181 -1.169887
1 -1.563262  0.150059  0.079555
2  0.170663       NaN  0.069613
3  2.523364       NaN  0.776363
4 -0.623658       NaN       NaN
5 -0.030194       NaN       NaN

In [13]:
df2.fillna(method="ffill", limit=2) # 用前面的值填充后面的空值，且最多填充两个

          0         1         2
0  2.271276  0.407181 -1.169887
1 -1.563262  0.150059  0.079555
2  0.170663  0.150059  0.069613
3  2.523364  0.150059  0.776363
4 -0.623658       NaN  0.776363
5 -0.030194       NaN  0.776363

In [14]:
df2.fillna(df2.mean())

          0         1         2
0  2.271276  0.407181 -1.169887
1 -1.563262  0.150059  0.079555
2  0.170663  0.278620  0.069613
3  2.523364  0.278620  0.776363
4 -0.623658  0.278620 -0.061089
5 -0.030194  0.278620 -0.061089

# 数据转换

## 删除重复值

In [15]:
data3 = pd.DataFrame({"k1":['one', 'two']*3 + ['two'], "k2":[1, 1, 2, 3, 3, 4, 4]})
data3

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [16]:
data3.duplicated() # 返回一个Series，其反映每一行是否存在重复情况

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [17]:
data3.drop_duplicates() # 返回duplicated()返回结果中为False的部分

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

## 使用函数或映射进行数据转换

In [18]:
data4 = pd.DataFrame({'food':['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon', 'pastrami', 'honey ham', 'nova lox'], 'ounces':[4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data4

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [19]:
meat_to_animal = {'bacon':'pig', 'pulled pork':'pig', 'pastrami':'cow', 'corned beef':'cow', 'honey ham':'pig', 'nova lox':'salmon'}

In [20]:
lowercased = data4['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [21]:
data4['animal'] = lowercased.map(meat_to_animal) # 使用字典进行映射转换
data4

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [22]:
data4['food'].map(lambda x: meat_to_animal[x.lower()]) # 利用匿名函数进行转换

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## 替代值

In [23]:
data5 = pd.Series([1, -999, 2, -999, -1000, 3])
data5

0       1
1    -999
2       2
3    -999
4   -1000
5       3
dtype: int64

In [25]:
data5.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [26]:
data5.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [27]:
data5.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [28]:
data5.replace({-999:np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## 重命名轴索引

In [29]:
data6 = pd.DataFrame(np.arange(12).reshape((3, 4)), index=['Ohio', 'Colorado', 'New York'], columns=['one', 'two', 'three', 'four'])

In [31]:
transform = lambda x: x[:4].upper()
data6.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [33]:
data6.index = data6.index.map(transform)
data6

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [35]:
data6.rename(index=str.title, columns=str.title)

      One  Two  Three  Four
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [36]:
data6.rename(index={'OHIO':'INDIANA'}, columns={'three':'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

## 离散化与分箱

In [37]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [38]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [39]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [40]:
pd.value_counts(cats) # 对箱数量的计数

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [42]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [43]:
data7 = np.random.rand(20)
pd.cut(data7, 4, precision=2) # 根据最大最小值均分成4个箱，小数精确到2位

[(0.76, 0.99], (0.76, 0.99], (0.32, 0.54], (0.54, 0.76], (0.097, 0.32], ..., (0.76, 0.99], (0.54, 0.76], (0.76, 0.99], (0.76, 0.99], (0.76, 0.99]]
Length: 20
Categories (4, interval[float64]): [(0.097, 0.32] < (0.32, 0.54] < (0.54, 0.76] < (0.76, 0.99]]

In [44]:
data8 = np.random.randn(1000) # 1000个正态分布的数据
pd.qcut(data8, 4) # 4分位数分箱

[(-3.173, -0.651], (0.685, 3.143], (-0.651, -0.0017], (-3.173, -0.651], (-0.651, -0.0017], ..., (0.685, 3.143], (-3.173, -0.651], (-3.173, -0.651], (0.685, 3.143], (0.685, 3.143]]
Length: 1000
Categories (4, interval[float64]): [(-3.173, -0.651] < (-0.651, -0.0017] < (-0.0017, 0.685] < (0.685, 3.143]]

In [45]:
pd.qcut(data8, [0, 0.1, 0.5, 0.9, 1]) # 自定义分位数分箱

[(-3.173, -1.263], (1.251, 3.143], (-1.263, -0.0017], (-1.263, -0.0017], (-1.263, -0.0017], ..., (1.251, 3.143], (-1.263, -0.0017], (-3.173, -1.263], (1.251, 3.143], (-0.0017, 1.251]]
Length: 1000
Categories (4, interval[float64]): [(-3.173, -1.263] < (-1.263, -0.0017] < (-0.0017, 1.251] < (1.251, 3.143]]

## 检测与过滤异常值

In [46]:
data9 = pd.DataFrame(np.random.randn(1000, 4))
data9.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.022048     0.006379    -0.030764     0.016049
std       1.039650     0.962269     0.996098     1.026052
min      -3.041336    -4.068776    -3.057194    -3.138328
25%      -0.676308    -0.626098    -0.715491    -0.684122
50%      -0.002683     0.025085     0.008497    -0.009090
75%       0.735704     0.642726     0.649350     0.734656
max       3.756144     3.745468     2.940663     2.887640

In [49]:
data9[2][np.abs(data9[2])>3]

242   -3.057194
Name: 2, dtype: float64

In [60]:
data9[(np.abs(data9)>3).any(1)]

            0         1         2         3
41  -0.073265 -3.141964  0.342209  1.443331
192 -2.730942  3.323857 -0.772304 -0.083489
212  3.072660 -1.525340  0.008486 -0.739714
241  0.346606 -0.323444 -0.112386 -3.138328
242  0.769712 -0.203246 -3.057194 -0.651976
258  0.147939 -4.068776  1.761695  0.608820
330  3.068714 -1.721229  0.371605  0.641726
372 -3.041336  0.087502  0.618780 -0.087106
490  3.756144  1.874852 -0.268240 -0.453174
629 -0.039546  1.958812  1.845303 -3.047428
667  0.840599 -3.313602 -0.773905 -1.418322
757 -0.517386  3.745468 -0.809119  2.124295

In [63]:
data9[np.abs(data9)>3] = np.sign(data9) * 3
data9.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.021192     0.006834    -0.030707     0.016234
std       1.036671     0.953129     0.995926     1.025495
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.676308    -0.626098    -0.715491    -0.684122
50%      -0.002683     0.025085     0.008497    -0.009090
75%       0.735704     0.642726     0.649350     0.734656
max       3.000000     3.000000     2.940663     2.887640

In [64]:
np.sign(data9).head() # np.sign()根据值的正、负、零返回1、-1、0

     0    1    2    3
0 -1.0 -1.0 -1.0  1.0
1 -1.0 -1.0  1.0 -1.0
2 -1.0 -1.0 -1.0  1.0
3 -1.0 -1.0 -1.0 -1.0
4 -1.0 -1.0 -1.0  1.0

## 置换与随机抽样

In [76]:
df3 = pd.DataFrame(np.arange(5*4).reshape((5, 4)))
sampler = np.random.permutation(5) # 将原有数组变成一维并随机排列，参数k代表选取原有数组的前k位
sampler

array([2, 1, 4, 3, 0])

In [77]:
df3.take(sampler) # 将df3的索引行按照sampler的值进行排列

    0   1   2   3
2   8   9  10  11
1   4   5   6   7
4  16  17  18  19
3  12  13  14  15
0   0   1   2   3

In [91]:
df3.sample(n=4, replace=False) # 随机抽样n=4行，replace=True表示可以有重复项

    0   1   2   3
1   4   5   6   7
0   0   1   2   3
3  12  13  14  15
2   8   9  10  11

## 计算指标/虚拟变量

In [92]:
df4 = pd.DataFrame({'key':['b', 'b', 'a', 'c', 'a', 'b'], 'data1':range(6)})
pd.get_dummies(df4['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [93]:
dummies = pd.get_dummies(df4['key'], prefix='key')
df_with_dummy = df4[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

# 字符串操作

## 字符串对象方法

In [96]:
val = 'a, b, guido'
val.split(',')  # 使用split()方法拆分

['a', ' b', ' guido']

In [97]:
pieces = [x.strip() for x in val.split(',')] # 结合strip()方法清楚空格
pieces

['a', 'b', 'guido']

In [98]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [99]:
'::'.join(pieces)

'a::b::guido'

In [100]:
val.count(',')

2

In [102]:
val.replace(',', '')

'a b guido'